app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(:page => params[:page], :per_page => 5)
---
SELECT "posts".* FROM "posts" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "text", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Mon, 30 Dec 2013 07:32:45 UTC +00:00], ["text", "<p>here is a new post!</p>"], ["updated_at", Mon, 30 Dec 2013 07:32:45 UTC +00:00]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "text" = $2, "date" = $3, "updated_at" = $4 WHERE "posts"."id" = 3