app/controllers/users_controller.rb

  def show
    @posts = Post.where(:user_id => current_user.id).sort! { |a, b| b.date <=> a.date}
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1

  def set_session
    p "GOT HERE!!!"
    @user = User.find_by_username(params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'rwarbelow' LIMIT 1